{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt6723592/", "name": "Tenet", "image": "https://m.media-amazon.com/images/M/MV5BYzg0NGM2NjAtNmIxOC00MDJmLTg5ZmYtYzM0MTE4NWE2NzlhXkEyXkFqcGdeQXVyMTA4NjE0NjEy._V1_.jpg", "genre": ["Action", "Sci-Fi", "Thriller"], "contentRating": "PG-13", "actor": [{"@type": "Person", "url": "/name/nm0913475/", "name": "John David Washington"}, {"@type": "Person", "url": "/name/nm1500155/", "name": "Robert Pattinson"}, {"@type": "Person", "url": "/name/nm4456120/", "name": "Elizabeth Debicki"}, {"@type": "Person", "url": "/name/nm1798449/", "name": "Juhan Ulfsak"}], "director": {"@type": "Person", "url": "/name/nm0634240/", "name": "Christopher Nolan"}, "creator": [{"@type": "Person", "url": "/name/nm0634240/", "name": "Christopher Nolan"}, {"@type": "Organization", "url": "/company/co0002663/"}, {"@type": "Organization", "url": "/company/co0147954/"}], "description": "Tenet is a movie starring John David Washington, Robert Pattinson, and Elizabeth Debicki. Armed with only one word, Tenet, and fighting for the survival of the entire world, a Protagonist journeys through a twilight world of...", "datePublished": "2020-08-26", "keywords": "written by director,car chase,time paradox,produced by director,symphony hall", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 346153, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.4"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt6723592/"}, "author": {"@type": "Person", "name": "shashthezarch"}, "dateCreated": "2020-08-26", "inLanguage": "English", "name": "Disappointing at first watch, Masterpiece at second. Just a little bit loud", "reviewBody": "Its one hell of a complicated film. It will be very hard for an average viewer to gather all the information provided by this movie at the first watch. But the more you watch it, more hidden elements will come to light. And when you are able to put these hidden elements together. You will realize that this movie is just a \"masterpiece\" which takes the legacy of Christopher Nolan Forward\n\nIf I talk about acting, Then I have to say that Robert Pattinson has really proved himself as a very good actor in these recent years. And I am sure his acting skills will increase with time. His performance is charming and very smooth. Whenever he is on the camera, he steals the focus John David Washington is also fantastic in this movie. His performance is electrifying, I hope to see more from him in the future. Other characters such as Kenneth Branagh, Elizabeth, Himesh Patel, Dimple Kapadia, Clémence Poésy have also done quite well. And I dont think there is a need to talk about Michael Caine\n\nTalking about Music, its awesome. I dont think you will miss Hans Zimmer's score. Ludwig has done a sufficient job. There is no lack of good score in the movie\n\nGotta love the editing and post production which has been put into this movie. I think its fair to say this Nolan film has focused more in its post production. The main problem in the movie is the sound mixing. Plot is already complex and some dialogues are very soft due to the high music score. It makes it harder to realize what is going on in the movie. Other Nolan movies had loud BGM too. But Audio and dialogues weren't a problem\n\nMy humble request to everyone is to please let the movie sink in your thoughts. Let your mind grasp all the elements of this movie. I am sure more people will find it better. Even those who think they got the plot. I can bet they are wrong.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "9"}}, "duration": "PT2H30M", "trailer": {"@type": "VideoObject", "name": "Final Trailer", "embedUrl": "/video/imdb/vi2051194393", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BZWM4MDJjNzMtYjk5Ni00MTJkLThlNjAtZDdjODhlNzU4ZTcwXkEyXkFqcGdeQWFybm8@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZWM4MDJjNzMtYjk5Ni00MTJkLThlNjAtZDdjODhlNzU4ZTcwXkEyXkFqcGdeQWFybm8@._V1_.jpg", "description": "Armed with only one word, Tenet, and fighting for the survival of the entire world, a Protagonist journeys through a twilight world of international espionage on a mission that will unfold in something beyond real time.", "uploadDate": "2020-08-22T05:38:42Z"}}