{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt1361336/", "name": "Tom and Jerry", "image": "https://m.media-amazon.com/images/M/MV5BYzE3ODhiNzAtOWY4MS00NTdiLThmNDctNDM4NjRiNGFmYjI1XkEyXkFqcGdeQXVyMTI2ODM1ODUw._V1_.jpg", "genre": ["Animation", "Comedy", "Family"], "contentRating": "PG", "actor": [{"@type": "Person", "url": "/name/nm1631269/", "name": "Chloë Grace Moretz"}, {"@type": "Person", "url": "/name/nm0671567/", "name": "Michael Peña"}, {"@type": "Person", "url": "/name/nm1906042/", "name": "Colin Jost"}, {"@type": "Person", "url": "/name/nm12312521/", "name": "Tom"}], "director": {"@type": "Person", "url": "/name/nm1103162/", "name": "Tim Story"}, "creator": [{"@type": "Person", "url": "/name/nm0360253/", "name": "William Hanna"}, {"@type": "Person", "url": "/name/nm0053484/", "name": "Joseph Barbera"}, {"@type": "Person", "url": "/name/nm8213708/", "name": "Kevin Costello"}, {"@type": "Organization", "url": "/company/co0468593/"}, {"@type": "Organization", "url": "/company/co0024579/"}, {"@type": "Organization", "url": "/company/co0180591/"}, {"@type": "Organization", "url": "/company/co0226345/"}, {"@type": "Organization", "url": "/company/co0226411/"}, {"@type": "Organization", "url": "/company/co0183824/"}, {"@type": "Organization", "url": "/company/co0072876/"}], "description": "Tom and Jerry is a movie starring Chloë Grace Moretz, Michael Peña, and Colin Jost. A chaotic battle ensues between Jerry Mouse, who has taken refuge in the Royal Gate Hotel, and Tom Cat, who is hired to drive him away before the...", "datePublished": "2021-02-11", "keywords": "jerry the mouse character,tom the cat character,hotel,new york city,duo", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 20479, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "5.2"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt1361336/"}, "author": {"@type": "Person", "name": "paul-86810"}, "dateCreated": "2021-04-01", "inLanguage": "English", "name": "Surprisingly Great.", "reviewBody": "N Manhattan, Tom Cat, who dreams of becoming a pianist, plays in Central Park, while his longtime rival Jerry Mouse is in search of a new home. During one of Tom's performances, Jerry picks a fight with him which ends with Tom's keyboard destroyed, followed by a chase.\n\nKayla Forester, a street-smart young woman doing odd jobs while living by her wits, ends up bumping into Tom while he is chasing Jerry. Looking for a position at New York's fanciest hotel, the Royal Gate, Kayla is tasked with helping event manager Terence Mendoza to set up a high-profile wedding, after presenting a stolen resume as her own. At the same time, Jerry takes up residence at the hotel, where his regular shenanigans involve stealing food and items to ramp up his new lifestyle.\n\nPreeta Mehta and her fiancé Ben, along with their pets Spike and Toots, arrive at the hotel, where they are met by Kayla and Terence, who both greet them, unaware of Jerry stealing from Preeta's handbag. As the couple is escorted to their rooms, Jerry's presence is made known, which puts the wedding and the hotel itself at risk. Kayla offers to help catch Jerry without anyone knowing, which impresses Henry Dubros, the hotel's general manager. In her failed pursuit to catch Jerry, Kayla befriends a bartender named Cameron. Meanwhile, a depressed Tom falls into despair, until he notices Jerry inside one of the hotel rooms. An enraged Tom goes after him, leading to the pair fighting and destroying the whole room. Kayla comes to check, due to noise complaints. She befriends Tom, and, persuades Dubros on hiring him to catch Jerry, despite Terence's disagreement.\n\nAfter many failed attempts, Tom designs a big mouse trap and finally succeeds in getting Jerry out of the hotel. Meanwhile, Kayla learns from Preeta that her engagement ring is missing and offers to help without Ben knowing, sparking a friendship between the two. Preeta also reveals that Ben hasn't been listening to her ideas about the wedding and has ordered various animals. Learning that Tom has gotten rid of Jerry, Kayla and Tom celebrate with Cameron, with Tom playing a song on the piano to impress Toots. However, Jerry returns and reveals to Kayla that he had Preeta's ring with him and agrees to give it back to her, if she lets him stay. Before Kayla can agree, Terence returns from walking Spike. Jerry hides in Kayla's coat pocket, sparking a chase during which Spike, Tom, and Jerry demolish the hotel lobby.\n\nTerence is put on leave, while Kayla takes over as event manager, for returning the ring stolen by Jerry. To prevent any more of Tom and Jerry's shenanigans risking the wedding, and, thus her job as well as Tom and Jerry's own chances of wanting to live in the hotel, Kayla tells them that they have to get along and spend the whole next day far away from the hotel, if they want to stay, to which they agree. Tom and Jerry bond during their trip, but are taken to a pet compound, after they inadvertently disrupt a baseball game.\n\nA vengeful Terence separately visits Tom and Jerry in their cell and secretly tells lies to Tom about Jerry and Jerry about Tom (behind their backs), angering them both. At the start of the wedding, Terence incites Tom and Jerry to fight, which ultimately results in the rest of the hotel getting wrecked, the wedding ruined, and Kayla leaving in shame, while Tom is physically kicked out by Terence.\n\nKnowing that it is their fault the wedding was ruined, Tom and Jerry finally put their differences aside and convince Kayla, the hotel crew and a reluctant Terence to work together and fix up everything. They pursue Preeta on an electric skateboard and aerial drone and lure her to Ben, which results in the wedding being held at Central Park, better than originally planned. Ben apologizes to Preeta and admits that he was only trying to impress her and her father and he got carried away, while Kayla, along with Linda Perrybottom, the woman from which she took the resume, get jobs at the hotel. As the film ends (with Tom pulling a curtain featuring the classic \"The End\" headline from the cartoons), the wedding continues, until a mishap caused by Jerry reignites his longtime cat-and-mouse battle with Tom.\n\nIn a post-credits scene, Ben finds he is being charged full-price for both weddings, thinking it's a joke. Mr. Dubros though tells him that Terence crunched some numbers, then leaves along with Terence. Ben stares with bewilderment.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "10"}}, "duration": "PT1H41M", "trailer": {"@type": "VideoObject", "name": "Official Trailer", "embedUrl": "/video/imdb/vi734511385", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTQ3ZGIzNjMtYWJhMC00MDRhLTgyYWItMjBjNzM0MTIzM2JlXkEyXkFqcGdeQWRvb2xpbmhk._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTQ3ZGIzNjMtYWJhMC00MDRhLTgyYWItMjBjNzM0MTIzM2JlXkEyXkFqcGdeQWRvb2xpbmhk._V1_.jpg", "description": "One of the most beloved rivalries in history is reignited when Jerry moves into New York City’s finest hotel on the eve of “the wedding of the century,” forcing the event’s desperate planner to hire Tom to get rid of him, in director Tim Story’s “Tom & Jerry.”  The ensuing cat and mouse battle threatens to destroy her career, the wedding and possibly the hotel itself. But soon, an even bigger problem arises: a diabolically ambitious staffer conspiring against all three of them.", "uploadDate": "2020-11-17T17:11:50Z"}}